// Вам потрібно реалізувати CRUD для машинок. Як базу беремо або масив, або файл.
// Необхідно: 1) взяти всі машинки, 2) взяти одину машинку, 3) створити машинку, 4) оновити машинку, 5) видалити машинку
//______________________________________________________________________________________________________________________
const express = require('express');
const app = express();

app.use(express.urlencoded({extended: true}));
app.use(express.json());

//______________________________________________________________________________________________________________________
const {apiRouter} = require('./routes');

app.use('/api', apiRouter);

//______________________________________________________________________________________________________________________
app.listen(5000, (err) => {
    if (err) console.log(err);
    console.log('Server listening on 5000');
});
